In [1]:
import pandas as pd
columns1 = ['Name','Age','Height']
data1 =[
    ['Ted', '24', '177'],
    ['Judy', '27', '183']
]



data2 = [
    ['Hank', '24', '177'],
]

In [2]:
df1 = pd.DataFrame(data=data1,columns=columns1)
df1

   Name Age Height
0   Ted  24    177
1  Judy  27    183

In [3]:
df2 = pd.DataFrame(data=data2,columns=columns1)
df2

   Name Age Height
0  Hank  24    177

In [4]:
result = df1.append(df2)
result

   Name Age Height
0   Ted  24    177
1  Judy  27    183
0  Hank  24    177

In [5]:
result.reset_index()

   index  Name Age Height
0      0   Ted  24    177
1      1  Judy  27    183
2      0  Hank  24    177